import { AccountingDepartment, Budget, Income } from "./accountingDepartment";
import { Administration } from "./administration";
import { CacheDesk } from "./cacheDesk";
import { MarketingDepartment } from "./marketingDepartment";
import { NotificationService } from "./utils";
import { db } from "./db";

class Zoo {
  private cacheDesk: CacheDesk;
  private administration: Administration;
  private accountingDepartment: AccountingDepartment;
  private marketingDepartment: MarketingDepartment;

  constructor() {
    this.cacheDesk = new CacheDesk(db, new NotificationService());
    this.administration = new Administration(db);
    this.accountingDepartment = new AccountingDepartment(
      db,
      new Income(db),
      new Budget(0, 0)
    );
    this.marketingDepartment = new MarketingDepartment(
      db,
      new NotificationService()
    );
  }
}

/*
ДЗ. Проект Zoo

До нас звернувся невеликий приватний зоопарк для створення застосунку, 
який полегшить управління бізнесом. 

1/Нижче опис сутностей, які є на даний момент. 

Вам необхідно ознайомиться, 
2/поставити уточнювальні запитання, 
після чого побудувати програму на основі наявних у вас знань. 
Використовуйте шаблони, можливості ТS і своє уявлення про прекрасне.

Проєкт "Зоопарк":

I. "Каса":
Відповідає за продаж квитків. 
Під час продажу квитка, Каса додає дані про відвідувача у два списки: поточні відвідувачі та клієнти.

1a. "Квитки"
Квитки можуть бути трьох видів: дорослі, дитячі та сімейні.
Кожен квиток має вартість.

"Поточні відвідувачі":
Зберігає інформацію про відвідувачів, включаючи їхні імена та контактні дані.
Можливість оповіщення відвідувачів за 15 хвилин до закриття і перед відходом.

II. "Клієнти":
Дані клієнтів зберігаються у Відділу реклами.
Відділ реклами використовує цей список для розсилки новин про зоопарк і рекламні акції.

III. "Відділ реклами":
Відповідає за маркетингові та рекламні заходи.
Використовує список клієнтів для розсилки новин про зоопарк і рекламні акції.

IV. "Виручка":
Каса збирає дані про виручку за день.
Ці дані передаються в Бухгалтерію.

V. "Бухгалтерія":
Відповідає за фінансове управління зоопарку.
Розпоряджається бюджетом, включно з оплатою співробітників, 
закупівлею корму для тварин і обслуговуванням зоопарку.
Зберігає дані про всіх співробітників, тварин і виплати.
//paymentId
Можливість генерувати фінансові звіти.

VI. "Адміністрація":
Відповідає за управління співробітниками і тваринами.
Може додавати і видаляти співробітників і тварин.
Створює сповіщення про рекламні акції та інші важливі події в зоопарку.

VII. "Тварини":
Включає в себе інформацію про кожну тварину, таку як вид, ім'я, вік, здоров'я та інші характеристики.

VIII. "Співробітники":
Адміністрація може додавати і видаляти співробітників.
Співробітники можуть мати різні посади та обов'язки, які слід враховувати.

IX. "Бюджет":
Бухгалтерія розпоряджається бюджетом і стежить за фінансами зоопарку.
Можливість вести бюджетний облік і надавати фінансові звіти.
*/
